using System;

namespace Task_1_from_Lesson_3
{
    /*
    ---------------------------- Условие задачи ----------------------------
    |    Постройте таблицу значений функции y=f(x) для х[a, b] с шагом h.   |
    |  Если в некоторой точке x функция не определена, то выведите на экран |
    |  сообщение об этом.                                                   |
    |   Замечание.                                                          |
    |   При решении данной задачи использовать вспомогательный метод f(x),  |
    | реализующий заданную функцию, а также проводить обработку возможных   |
    | исключений.                                                           |
    -------------------------------------------------------------------------
     */
    class Program 
    {
        static void Main()
        {

        }
    }    
}